export const nameRegex =
    /[${a-zA-ZáàâäãåçéèêëíìîïñóòôöõúùûüýÿæœÁÀÂÄÃÅÇÉÈÊËßÍÌÎÏÑÓÒÔÖÕÚÙÛÜÝŸÆŒ}][${a-zA-ZáàâäãåçéèêëíìîïñóòôöõúùûüýÿæœÁÀÂÄÃÅÇÉÈßÊËÍÌÎÏÑÓÒÔÖÕÚÙÛÜÝŸÆŒ}' ,"-]*[${a-zA-ZáàâäãåçéèêëíìîïñóòôöõúùûüýÿæœÁÀÂÄÃÅÇÉÈÊËÍßÌÎÏÑÓÒÔÖÕÚÙÛÜÝŸÆŒ}'",]+/i;

export const emailRegex =
    /[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*@(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?/i;

export const timeRegex = /^((?:[0-9]|1[0-9]|2[0-3])(?:.d{1,2})?|24(?:.00?)?)$')/;
